In [1]:
import numpy as np
import pandas as pd

In [3]:
s= pd.Series ([])
print(s)

Series([], dtype: float64)

C:\Users\noble\AppData\Local\Temp\ipykernel_11280\748301359.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  s= pd.Series ([])

In [4]:
s= pd.Series ([])
print(s)

Series([], dtype: float64)

C:\Users\noble\AppData\Local\Temp\ipykernel_11280\748301359.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  s= pd.Series ([])

In [5]:
s= pd.Series ([100,101,102])
print(s)

0    100
1    101
2    102
dtype: int64

In [6]:
ar= np.array ([100,101,102])
print(ar)

[100 101 102]

In [7]:
arr1 =np.array ([10,12,14,16,18,20])
series =pd.Series(arr1)
print (series)

0    10
1    12
2    14
3    16
4    18
5    20
dtype: int32

In [8]:
arr1 =np.array ([10,12,14,16,18,20])
series =pd.Series(arr1)
print (series)

0    10
1    12
2    14
3    16
4    18
5    20
dtype: int32

In [9]:
print (series[2:5])
print (series[2:])
print (series[:5])

2    14
3    16
4    18
dtype: int32
2    14
3    16
4    18
5    20
dtype: int32
0    10
1    12
2    14
3    16
4    18
dtype: int32

In [10]:
dict1 = {'Q1':1,'Q2':2,'Q3':3,'Q4':4}
series =pd.Series (dict1)
print (series)

Q1    1
Q2    2
Q3    3
Q4    4
dtype: int64

In [11]:
print (series ['Q1':'Q3'])

Q1    1
Q2    2
Q3    3
dtype: int64

In [12]:
print (series ['Q2':'Q3'])

Q2    2
Q3    3
dtype: int64

In [13]:
series[1] =100
print (series)

Q1      1
Q2    100
Q3      3
Q4      4
dtype: int64

In [14]:
list1 = [10,20,30,40,50,60]
S1= pd.Series (list1)
print (S1)

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64

In [15]:
pd.DataFrame(S1)

    0
0  10
1  20
2  30
3  40
4  50
5  60

In [16]:
list2 = [{'Name': 'John','Age':25}, {'Name':'Sam','Age':20},
         {'Name':'Eric','Age':30},{'Name':'Ken','Age':28}]
dataframe2=pd.DataFrame(list2)
print (dataframe2)

   Name  Age
0  John   25
1   Sam   20
2  Eric   30
3   Ken   28

In [17]:
dataframe2['Name']

0    John
1     Sam
2    Eric
3     Ken
Name: Name, dtype: object

In [18]:
list2 = [{'Name': ['John','Sam','Eric','Ken'],'Age':[25,20,30,28] }]
dataframe2=pd.DataFrame(list2)
print (dataframe2)

                     Name               Age
0  [John, Sam, Eric, Ken]  [25, 20, 30, 28]

In [19]:
list2 = [{'Name': ['John','Sam','Eric','Ken'],'Age':[25,20,30,28] }]
dataframe2=pd.DataFrame(list2)
print (dataframe2)

                     Name               Age
0  [John, Sam, Eric, Ken]  [25, 20, 30, 28]

In [20]:
list2 = {'Name': ['John','Sam','Eric','Ken'],'Age':[25,20,30,28] }
dataframe2=pd.DataFrame(list2)
print (dataframe2)

   Name  Age
0  John   25
1   Sam   20
2  Eric   30
3   Ken   28

In [21]:
list2= [['Sam', 28,5362],['Ken','Tom',32,7500], ['Eric',45,8512]]
df2 = pd.DataFrame(list2)
print (df2)

      0    1     2       3
0   Sam   28  5362     NaN
1   Ken  Tom    32  7500.0
2  Eric   45  8512     NaN

In [22]:
list2= [[28,'Sam', 5362],['Ken','Tom',32,7500], ['Eric',45,8512]]
df2 = pd.DataFrame(list2)
print (df2)

      0    1     2       3
0    28  Sam  5362     NaN
1   Ken  Tom    32  7500.0
2  Eric   45  8512     NaN

In [24]:
list2 = [{'Name': 'John','Age':25}, {'Name':'Sam','Age':20},
         {'Name':'Eric','Age':30},{'Age':28,'Name':'Ken','Last_Name':'Soto'}]
dataframe2=pd.DataFrame(list2)
print (dataframe2)

   Name  Age Last_Name
0  John   25       NaN
1   Sam   20       NaN
2  Eric   30       NaN
3   Ken   28      Soto

In [25]:
list2 = [{'Name': 'John','Age':25}, {'Name':'Sam','Age':20},
         {'Name':'Eric','Age':30},{'Name':'Ken','Age':28,'Last_Name':'Soto'}]
dataframe2=pd.DataFrame(list2,index  = ['Row 1','Row 2','Row 3','Row 4'])
print (dataframe2)

       Name  Age Last_Name
Row 1  John   25       NaN
Row 2   Sam   20       NaN
Row 3  Eric   30       NaN
Row 4   Ken   28      Soto

In [28]:
list2 = [{'Name': 'John','Age':25}, {'Name':'Sam','Age':20},
         {'Name':'Eric','Age':30},{'Name':'Ken','Age':28,'Last_Name':'Soto'}]
dataframe2=pd.DataFrame(list2,index  = ['Row 1','Row 2',4500,'Row 1'])
print (dataframe2)

       Name  Age Last_Name
Row 1  John   25       NaN
Row 2   Sam   20       NaN
4500   Eric   30       NaN
Row 1   Ken   28      Soto

In [29]:
dataframe2.loc['Row 1']

       Name  Age Last_Name
Row 1  John   25       NaN
Row 1   Ken   28      Soto

In [32]:
pd.Series ([10,11,12],index = ['a','b','c'])

a    10
b    11
c    12
dtype: int64

In [33]:
pd.Series ([10,11,12,13],index = ['a','b','c','d'])

a    10
b    11
c    12
d    13
dtype: int64

In [30]:
data1 = {'a': pd.Series ([10,11,12],index = ['a','b','c']),'b': pd.Series ([10,11,12,13],index = ['a','b','c','d'])}
tab1 = pd.DataFrame(data1)
print (tab1)

      a   b
a  10.0  10
b  11.0  11
c  12.0  12
d   NaN  13

In [34]:
data1 = {'a': pd.Series ([10,11,12],index = ['a','b','c']),
         'b': pd.Series ([10,11,12,13],index = ['a','b','c','d']),
        'c': pd.Series ([20,21,22,23])}
tab1 = pd.DataFrame(data1)
print (tab1)

      a     b     c
a  10.0  10.0   NaN
b  11.0  11.0   NaN
c  12.0  12.0   NaN
d   NaN  13.0   NaN
0   NaN   NaN  20.0
1   NaN   NaN  21.0
2   NaN   NaN  22.0
3   NaN   NaN  23.0

In [36]:
data = {'one':pd.Series ([1,2,3], index = ['a','b','c']), 
        'two':pd.Series ([10,15,20,30], index = ['a','b','c','d']) }
Ser= pd.DataFrame(data)
Ser

   one  two
a  1.0   10
b  2.0   15
c  3.0   20
d  NaN   30

In [37]:
Ser['three'] = pd.Series ([10,20,50],index = ['a','b','c'])
print (Ser)

   one  two  three
a  1.0   10   10.0
b  2.0   15   20.0
c  3.0   20   50.0
d  NaN   30    NaN

In [38]:
Ser['Four'] = pd.Series ([30,31,32],index = ['d','b','a'])
print (Ser)

   one  two  three  Four
a  1.0   10   10.0  32.0
b  2.0   15   20.0  31.0
c  3.0   20   50.0   NaN
d  NaN   30    NaN  30.0

In [40]:
Ser['Five'] = pd.Series ([40,41,42,43],index = ['a','b','e','f'])
print (Ser)

   one  two  three  Four  Five
a  1.0   10   10.0  32.0  40.0
b  2.0   15   20.0  31.0  41.0
c  3.0   20   50.0   NaN   NaN
d  NaN   30    NaN  30.0   NaN

In [42]:
dataframe2

      Name  Age Last_Name
Row1  John   25       NaN
Row2   Sam   20       NaN
Row3  Eric   30       NaN
Row4   Ken   28      Soto

In [41]:
list2 = [{'Name': 'John','Age':25}, {'Name':'Sam','Age':20},
         {'Name':'Eric','Age':30},{'Name':'Ken','Age':28,'Last_Name':'Soto'}]
dataframe2=pd.DataFrame(list2,index  = ['Row1','Row2','Row3','Row4'])
print (dataframe2['Name'])

Row1    John
Row2     Sam
Row3    Eric
Row4     Ken
Name: Name, dtype: object

In [43]:
print (dataframe2[['Name']])

      Name
Row1  John
Row2   Sam
Row3  Eric
Row4   Ken

In [44]:
print (dataframe2 [['Name','Age']])

      Name  Age
Row1  John   25
Row2   Sam   20
Row3  Eric   30
Row4   Ken   28

In [45]:
dataframe2.columns

Index(['Name', 'Age', 'Last_Name'], dtype='object')

In [46]:
print (dataframe2.columns [1])

Age

In [48]:
print (dataframe2.columns [1:3])

Index(['Age', 'Last_Name'], dtype='object')

In [49]:
dataframe2['Age']

Row1    25
Row2    20
Row3    30
Row4    28
Name: Age, dtype: int64

In [50]:
dataframe2.columns[1]

'Age'

In [51]:
dataframe2[dataframe2.columns[1]]

Row1    25
Row2    20
Row3    30
Row4    28
Name: Age, dtype: int64

In [52]:
dataframe2[dataframe2.columns[1:3]]

      Age Last_Name
Row1   25       NaN
Row2   20       NaN
Row3   30       NaN
Row4   28      Soto

In [53]:
print (dataframe2[dataframe2.columns [:2]])

      Name  Age
Row1  John   25
Row2   Sam   20
Row3  Eric   30
Row4   Ken   28

In [54]:
print (dataframe2[dataframe2.columns [1:]])

      Age Last_Name
Row1   25       NaN
Row2   20       NaN
Row3   30       NaN
Row4   28      Soto

In [55]:
dataframe2

      Name  Age Last_Name
Row1  John   25       NaN
Row2   Sam   20       NaN
Row3  Eric   30       NaN
Row4   Ken   28      Soto

In [57]:
print (dataframe2.loc['Row1'])

Name         John
Age            25
Last_Name     NaN
Name: Row1, dtype: object

In [58]:
print (dataframe2.loc[['Row1']])

      Name  Age Last_Name
Row1  John   25       NaN

In [59]:
print (dataframe2.loc['Row2':])

      Name  Age Last_Name
Row2   Sam   20       NaN
Row3  Eric   30       NaN
Row4   Ken   28      Soto

In [60]:
print (dataframe2.loc[:'Row3'])

      Name  Age Last_Name
Row1  John   25       NaN
Row2   Sam   20       NaN
Row3  Eric   30       NaN

In [61]:
dataframe2

      Name  Age Last_Name
Row1  John   25       NaN
Row2   Sam   20       NaN
Row3  Eric   30       NaN
Row4   Ken   28      Soto

In [63]:
dataframe2

      Name  Age Last_Name
Row1  John   25       NaN
Row2   Sam   20       NaN
Row3  Eric   30       NaN
Row4   Ken   28      Soto

In [64]:

print (dataframe2.iloc [1])

Name         Sam
Age           20
Last_Name    NaN
Name: Row2, dtype: object

In [65]:
print (dataframe2.iloc [[1]])

     Name  Age Last_Name
Row2  Sam   20       NaN

In [68]:
print (dataframe2.iloc [1:3])

      Name  Age Last_Name
Row2   Sam   20       NaN
Row3  Eric   30       NaN

In [69]:
print (dataframe2.iloc [:3])

      Name  Age Last_Name
Row1  John   25       NaN
Row2   Sam   20       NaN
Row3  Eric   30       NaN

In [67]:
print (dataframe2.iloc [1:])

      Name  Age Last_Name
Row2   Sam   20       NaN
Row3  Eric   30       NaN
Row4   Ken   28      Soto

In [70]:
dataframe2

      Name  Age Last_Name
Row1  John   25       NaN
Row2   Sam   20       NaN
Row3  Eric   30       NaN
Row4   Ken   28      Soto

In [77]:
'''
SAM   20
ERIC  30
'''
dataframe2.iloc[1:3, 0:2]

      Name  Age
Row2   Sam   20
Row3  Eric   30

In [81]:
dataframe2

      Name  Age Last_Name
Row1  John   25       NaN
Row2   Sam   20       NaN
Row3  Eric   30       NaN
Row4   Ken   28      Soto

In [82]:
row1=pd.DataFrame([['Bob',32],['Mike',28]],columns = ['Name', 'Age'])
row1

   Name  Age
0   Bob   32
1  Mike   28

In [83]:
dataframe2 = dataframe2.append (row1)
print (dataframe2)

      Name  Age Last_Name
Row1  John   25       NaN
Row2   Sam   20       NaN
Row3  Eric   30       NaN
Row4   Ken   28      Soto
0      Bob   32       NaN
1     Mike   28       NaN

C:\Users\noble\AppData\Local\Temp\ipykernel_11280\3849135346.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  dataframe2 = dataframe2.append (row1)

In [84]:
dataframe2 = dataframe2.append (row1)
print (dataframe2)

      Name  Age Last_Name
Row1  John   25       NaN
Row2   Sam   20       NaN
Row3  Eric   30       NaN
Row4   Ken   28      Soto
0      Bob   32       NaN
1     Mike   28       NaN
0      Bob   32       NaN
1     Mike   28       NaN

C:\Users\noble\AppData\Local\Temp\ipykernel_11280\638148685.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  dataframe2 = dataframe2.append (row1)

In [90]:
dataframe2

      Name  Age Last_Name
Row1  John   25       NaN
Row2   Sam   20       NaN
Row3  Eric   30       NaN
Row4   Ken   28      Soto
0      Bob   32       NaN
1     Mike   28       NaN
0      Bob   32       NaN
1     Mike   28       NaN

In [91]:
dataframe2.drop ('Row1')

      Name  Age Last_Name
Row2   Sam   20       NaN
Row3  Eric   30       NaN
Row4   Ken   28      Soto
0      Bob   32       NaN
1     Mike   28       NaN
0      Bob   32       NaN
1     Mike   28       NaN

In [93]:
Dataframe2=dataframe2.drop ('Row1')
print (Dataframe2)
Dataframe2=dataframe2.drop (0)

      Name  Age Last_Name
Row2   Sam   20       NaN
Row3  Eric   30       NaN
Row4   Ken   28      Soto
0      Bob   32       NaN
1     Mike   28       NaN
0      Bob   32       NaN
1     Mike   28       NaN

In [89]:
print (Dataframe2)

      Name  Age Last_Name
Row1  John   25       NaN
Row2   Sam   20       NaN
Row3  Eric   30       NaN
Row4   Ken   28      Soto
1     Mike   28       NaN
1     Mike   28       NaN

In [94]:
Dataframe2

      Name  Age Last_Name
Row1  John   25       NaN
Row2   Sam   20       NaN
Row3  Eric   30       NaN
Row4   Ken   28      Soto
1     Mike   28       NaN
1     Mike   28       NaN

In [95]:
Dataframe2=dataframe2.drop ('Row1')
Dataframe2

      Name  Age Last_Name
Row2   Sam   20       NaN
Row3  Eric   30       NaN
Row4   Ken   28      Soto
0      Bob   32       NaN
1     Mike   28       NaN
0      Bob   32       NaN
1     Mike   28       NaN

In [96]:
Dataframe2

      Name  Age Last_Name
Row2   Sam   20       NaN
Row3  Eric   30       NaN
Row4   Ken   28      Soto
0      Bob   32       NaN
1     Mike   28       NaN
0      Bob   32       NaN
1     Mike   28       NaN

In [97]:
Dataframe2= Dataframe2.drop (0)
Dataframe2

      Name  Age Last_Name
Row2   Sam   20       NaN
Row3  Eric   30       NaN
Row4   Ken   28      Soto
1     Mike   28       NaN
1     Mike   28       NaN

In [98]:
Ser

   one  two  three  Four  Five
a  1.0   10   10.0  32.0  40.0
b  2.0   15   20.0  31.0  41.0
c  3.0   20   50.0   NaN   NaN
d  NaN   30    NaN  30.0   NaN

In [99]:
del(Ser['three'])
print (Ser)

   one  two  Four  Five
a  1.0   10  32.0  40.0
b  2.0   15  31.0  41.0
c  3.0   20   NaN   NaN
d  NaN   30  30.0   NaN

In [103]:
Ser= Ser.drop ('Five', axis =1)

In [104]:
Ser

   one  two  Four
a  1.0   10  32.0
b  2.0   15  31.0
c  3.0   20   NaN
d  NaN   30  30.0

In [107]:
Ser

   two  Four
a   10  32.0
b   15  31.0
c   20   NaN
d   30  30.0

In [108]:
x= Ser.pop('two')
print (Ser)
print (x)

   Four
a  32.0
b  31.0
c   NaN
d  30.0
a    10
b    15
c    20
d    30
Name: two, dtype: int64

In [109]:
x

a    10
b    15
c    20
d    30
Name: two, dtype: int64

In [110]:
Ser

   Four
a  32.0
b  31.0
c   NaN
d  30.0

In [111]:
Student_Data = {'Student_id': ['AAA-123-2211','BBB-542-8542','CCC-854-8541','AAA-856-7458',
                               'DDD-745-7841'], 'First_Name': ['Sam','Jim','Rick','Ben','Kevin'],
               'Last_Name': ['Edison','Mon','Dany','Denil','Pocket']}
student= pd.DataFrame (Student_Data, columns = ['Student_id','First_Name','Last_Name'])
print (student)

     Student_id First_Name Last_Name
0  AAA-123-2211        Sam    Edison
1  BBB-542-8542        Jim       Mon
2  CCC-854-8541       Rick      Dany
3  AAA-856-7458        Ben     Denil
4  DDD-745-7841      Kevin    Pocket

In [112]:
Student_Course= {'stu_id':['AAA-123-2211','BBB-542-8542','CCC-854-7458','AAA-856-7458',
                               'DDD-745-7841'],'course':['ML','DS','RPA','BI','DL'],
                 'duration':[3,4,2,5,2]}
course = pd.DataFrame(Student_Course)
course

         stu_id course  duration
0  AAA-123-2211     ML         3
1  BBB-542-8542     DS         4
2  CCC-854-7458    RPA         2
3  AAA-856-7458     BI         5
4  DDD-745-7841     DL         2

In [113]:
print (pd.concat([student,course]))

     Student_id First_Name Last_Name        stu_id course  duration
0  AAA-123-2211        Sam    Edison           NaN    NaN       NaN
1  BBB-542-8542        Jim       Mon           NaN    NaN       NaN
2  CCC-854-8541       Rick      Dany           NaN    NaN       NaN
3  AAA-856-7458        Ben     Denil           NaN    NaN       NaN
4  DDD-745-7841      Kevin    Pocket           NaN    NaN       NaN
0           NaN        NaN       NaN  AAA-123-2211     ML       3.0
1           NaN        NaN       NaN  BBB-542-8542     DS       4.0
2           NaN        NaN       NaN  CCC-854-7458    RPA       2.0
3           NaN        NaN       NaN  AAA-856-7458     BI       5.0
4           NaN        NaN       NaN  DDD-745-7841     DL       2.0

In [114]:
Student_Data = {'stu_id': ['AAA-123-2211','BBB-542-8542','CCC-854-8541','AAA-856-7458',
                               'DDD-745-7841'], 'First_Name': ['Sam','Jim','Rick','Ben','Kevin'],
               'Last_Name': ['Edison','Mon','Dany','Denil','Pocket']}
student= pd.DataFrame (Student_Data, columns = ['stu_id','First_Name','Last_Name'])
print (student)

         stu_id First_Name Last_Name
0  AAA-123-2211        Sam    Edison
1  BBB-542-8542        Jim       Mon
2  CCC-854-8541       Rick      Dany
3  AAA-856-7458        Ben     Denil
4  DDD-745-7841      Kevin    Pocket

In [115]:
print (pd.concat([student,course]))

         stu_id First_Name Last_Name course  duration
0  AAA-123-2211        Sam    Edison    NaN       NaN
1  BBB-542-8542        Jim       Mon    NaN       NaN
2  CCC-854-8541       Rick      Dany    NaN       NaN
3  AAA-856-7458        Ben     Denil    NaN       NaN
4  DDD-745-7841      Kevin    Pocket    NaN       NaN
0  AAA-123-2211        NaN       NaN     ML       3.0
1  BBB-542-8542        NaN       NaN     DS       4.0
2  CCC-854-7458        NaN       NaN    RPA       2.0
3  AAA-856-7458        NaN       NaN     BI       5.0
4  DDD-745-7841        NaN       NaN     DL       2.0

In [116]:
print (pd.concat([student,course], axis =1))

         stu_id First_Name Last_Name        stu_id course  duration
0  AAA-123-2211        Sam    Edison  AAA-123-2211     ML         3
1  BBB-542-8542        Jim       Mon  BBB-542-8542     DS         4
2  CCC-854-8541       Rick      Dany  CCC-854-7458    RPA         2
3  AAA-856-7458        Ben     Denil  AAA-856-7458     BI         5
4  DDD-745-7841      Kevin    Pocket  DDD-745-7841     DL         2

In [117]:
Student_Data = {'Student_id': ['AAA-123-2211','BBB-542-8542','CCC-854-8541','AAA-856-7458',
                               'DDD-745-7841'], 'First_Name': ['Sam','Jim','Rick','Ben','Kevin'],
               'Last_Name': ['Edison','Mon','Dany','Denil','Pocket']}
student= pd.DataFrame (Student_Data, columns = ['Student_id','First_Name','Last_Name'])
print (student)

     Student_id First_Name Last_Name
0  AAA-123-2211        Sam    Edison
1  BBB-542-8542        Jim       Mon
2  CCC-854-8541       Rick      Dany
3  AAA-856-7458        Ben     Denil
4  DDD-745-7841      Kevin    Pocket

In [118]:
pd.merge(student,course,left_on= 'Student_id',right_on ='stu_id', how = 'inner')

     Student_id First_Name Last_Name        stu_id course  duration
0  AAA-123-2211        Sam    Edison  AAA-123-2211     ML         3
1  BBB-542-8542        Jim       Mon  BBB-542-8542     DS         4
2  AAA-856-7458        Ben     Denil  AAA-856-7458     BI         5
3  DDD-745-7841      Kevin    Pocket  DDD-745-7841     DL         2

In [119]:
pd.merge(student,course,left_on= 'Student_id',right_on ='stu_id', how = 'left')

     Student_id First_Name Last_Name        stu_id course  duration
0  AAA-123-2211        Sam    Edison  AAA-123-2211     ML       3.0
1  BBB-542-8542        Jim       Mon  BBB-542-8542     DS       4.0
2  CCC-854-8541       Rick      Dany           NaN    NaN       NaN
3  AAA-856-7458        Ben     Denil  AAA-856-7458     BI       5.0
4  DDD-745-7841      Kevin    Pocket  DDD-745-7841     DL       2.0

In [120]:
pd.merge(student,course,left_on= 'Student_id',right_on ='stu_id', how = 'right')

     Student_id First_Name Last_Name        stu_id course  duration
0  AAA-123-2211        Sam    Edison  AAA-123-2211     ML         3
1  BBB-542-8542        Jim       Mon  BBB-542-8542     DS         4
2           NaN        NaN       NaN  CCC-854-7458    RPA         2
3  AAA-856-7458        Ben     Denil  AAA-856-7458     BI         5
4  DDD-745-7841      Kevin    Pocket  DDD-745-7841     DL         2

In [122]:
pd.merge(student,course,left_on= 'Student_id',right_on ='stu_id', how = 'outer')

     Student_id First_Name Last_Name        stu_id course  duration
0  AAA-123-2211        Sam    Edison  AAA-123-2211     ML       3.0
1  BBB-542-8542        Jim       Mon  BBB-542-8542     DS       4.0
2  CCC-854-8541       Rick      Dany           NaN    NaN       NaN
3  AAA-856-7458        Ben     Denil  AAA-856-7458     BI       5.0
4  DDD-745-7841      Kevin    Pocket  DDD-745-7841     DL       2.0
5           NaN        NaN       NaN  CCC-854-7458    RPA       2.0

In [123]:
left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5']})
right = pd.DataFrame({
	'id':[1,2,3,4,5],
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5']})
print (left)
print ('\n')
print (right)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5


   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [124]:
print (pd.merge(left,right,on=['id','subject_id']))

   id  Name_x subject_id Name_y
0   4   Alice       sub6  Bryce
1   5  Ayoung       sub5  Betty

In [125]:
print (pd.merge(left,right,on=['id','subject_id'],how = 'left'))

   id  Name_x subject_id Name_y
0   1    Alex       sub1    NaN
1   2     Amy       sub2    NaN
2   3   Allen       sub4    NaN
3   4   Alice       sub6  Bryce
4   5  Ayoung       sub5  Betty

In [126]:
print (pd.merge(left,right,on=['id','subject_id'],how = 'right'))

   id  Name_x subject_id Name_y
0   1     NaN       sub2  Billy
1   2     NaN       sub4  Brian
2   3     NaN       sub3   Bran
3   4   Alice       sub6  Bryce
4   5  Ayoung       sub5  Betty

In [127]:
print (pd.merge(left,right,on=['id','subject_id'],how = 'outer'))

   id  Name_x subject_id Name_y
0   1    Alex       sub1    NaN
1   2     Amy       sub2    NaN
2   3   Allen       sub4    NaN
3   4   Alice       sub6  Bryce
4   5  Ayoung       sub5  Betty
5   1     NaN       sub2  Billy
6   2     NaN       sub4  Brian
7   3     NaN       sub3   Bran